tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf4580_tdd.h
#define LA0                           3881
#define LATA1                         3882
#define LA1                           3883
#define LATA2                         3884
#define LA2                           3885
#define LATA3                         3886
#define LA3                           3887
#define LATA4                         3888
#define LA4                           3889
#define LATA5                         3890
#define LA5                           3891
#define LATA6                         3892
#define LA6                           3893
#define LATA7                         3894
#define LA7                           3895
#define LATB                          3896
#define LB0                           3897
#define LATB0                         3898
#define LB1                           3899
#define LATB1                         3900
#define LB2                           3901
#define LATB2                         3902
#define LB3                           3903
#define LATB3                         3904
#define LB4                           3905
#define LATB4                         3906
#define LB5                           3907
#define LATB5                         3908
#define LB6                           3909
#define LATB6                         3910
#define LB7                           3911
#define LATB7                         3912
#define LATC                          3913
#define LATC0                         3914
#define LC0                           3915
#define LATC1                         3916
#define LC1                           3917
#define LATC2                         3918
#define LC2                           3919
#define LATC3                         3920
#define LC3                           3921
#define LATC4                         3922
#define LC4                           3923
#define LATC5                         3924
#define LC5                           3925
#define LATC6                         3926
#define LC6                           3927
#define LATC7                         3928
#define LC7                           3929
#define LATD                          3930
#define LATD0                         3931
#define LD0                           3932
#define LATD1                         3933
#define LD1                           3934
#define LATD2                         3935
#define LD2                           3936
#define LATD3                         3937
#define LD3                           3938
#define LATD4                         3939
#define LD4                           3940
#define LATD5                         3941
#define LD5                           3942
#define LATD6                         3943
#define LD6                           3944
#define LATD7                         3945
#define LD7                           3946
#define LATE                          3947
#define LATE0                         3948
#define LE0                           3949
#define LATE1                         3950
#define LE1                           3951
#define LATE2                         3952
#define LE2                           3953
#define TRISA                         3954
#define TRISA0                        3955
#define TRISA_RA0                     3956
#define TRISA1                        3957
#define TRISA_RA1                     3958
#define TRISA2                        3959
#define TRISA_RA2                     3960
#define TRISA3                        3961
#define TRISA_RA3                     3962
#define TRISA_RA4                     3963
#define TRISA4                        3964
#define TRISA_RA5                     3965
#define TRISA5                        3966
#define TRISA_RA6                     3967
#define TRISA6                        3968
#define TRISA_RA7                     3969
#define TRISA7                        3970
#define TRISB                         3971
#define TRISB_RB0                     3972
#define TRISB0                        3973
#define TRISB_RB1                     3974
#define TRISB1                        3975
#define TRISB_RB2                     3976
#define TRISB2                        3977
#define TRISB_RB3                     3978
#define TRISB3                        3979
#define TRISB_RB4                     3980
#define TRISB4                        3981
#define TRISB_RB5                     3982
#define TRISB5                        3983
#define TRISB_RB6                     3984
#define TRISB6                        3985
#define TRISB_RB7                     3986
#define TRISB7                        3987
#define TRISC                         3988
#define TRISC0                        3989
#define TRISC_RC0                     3990
#define TRISC1                        3991
#define TRISC_RC1                     3992
#define TRISC2                        3993
#define TRISC_RC2                     3994
#define TRISC3                        3995
#define TRISC_RC3                     3996
#define TRISC4                        3997
#define TRISC_RC4                     3998
#define TRISC5                        3999
#define TRISC_RC5                     4000
#define TRISC6                        4001
#define TRISC_RC6                     4002
#define TRISC7                        4003
#define TRISC_RC7                     4004
#define TRISD                         4005
#define TRISD_RD0                     4006
#define TRISD0                        4007
#define TRISD_RD1                     4008
#define TRISD1                        4009
#define TRISD_RD2                     4010
#define TRISD2                        4011
#define TRISD_RD3                     4012
#define TRISD3                        4013
#define TRISD_RD4                     4014
#define TRISD4                        4015
#define TRISD_RD5                     4016
#define TRISD5                        4017
#define TRISD_RD6                     4018
#define TRISD6                        4019
#define TRISD_RD7                     4020
#define TRISD7                        4021
#define TRISE                         4022
#define TRISE_RE0                     4023
#define TRISE0                        4024
#define TRISE_RE1                     4025
#define TRISE1                        4026
#define TRISE_RE2                     4027
#define TRISE2                        4028
#define PSPMODE                       4029
#define IBOV                          4030
#define OBF                           4031
#define IBF                           4032
#define OSCTUNE                       4033
#define TUN0                          4034
#define TUN                           4035
#define TUN1                          4036
#define TUN2                          4037
#define TUN3                          4038
#define TUN4                          4039
#define PLLEN                         4040
#define INTSCR                        4041
#define INTSRC                        4042
#define PIE1                          4043
#define TMR1IE                        4044
#define TMR2IE                        4045
#define CCP1IE                        4046
#define SSPIE                         4047
#define PIE1_TX1IE                    4048
#define TXIE                          4049
#define RCIE                          4050
#define RC1IE                         4051
#define ADIE                          4052
#define PSPIE                         4053
#define PIR1                          4054
#define TMR1IF                        4055
#define TMR2IF                        4056
#define CCP1IF                        4057
#define SSPIF                         4058
#define TXIF                          4059
#define PIR1_TX1IF                    4060
#define RCIF                          4061
#define RC1IF                         4062
#define ADIF                          4063
#define PSPIF                         4064
#define IPR1                          4065
#define TMR1IP                        4066
#define TMR2IP                        4067
#define CCP1IP                        4068
#define SSPIP                         4069
#define TXBIP                         4070
#define TX1IP                         4071
#define TXIP                          4072
#define RCIP                          4073
#define RC1IP                         4074
#define ADIP                          4075
#define PSPIP                         4076
#define PIE2                          4077
#define ECCP1IE                       4078
#define TMR3IE                        4079
#define HLVDIE                        4080
#define LVDIE                         4081
#define BCLIE                         4082
#define EEIE                          4083
#define CMIE                          4084
#define OSCFIE                        4085
#define PIR2                          4086
#define ECCP1IF                       4087
#define TMR3IF                        4088
#define HLVDIF                        4089
#define LVDIF                         4090
#define BCLIF                         4091
#define EEIF                          4092
#define CMIF                          4093
#define OSCFIF                        4094
#define IPR2                          4095
#define ECCP1IP                       4096
#define TMR3IP                        4097
#define HLVDIP                        4098
#define LVDIP                         4099
#define BCLIP                         4100
#define EEIP                          4101
#define CMIP                          4102
#define OSCFIP                        4103
#define PIE3                          4104
#define FIFOMWIE                      4105
#define FIFOWMIE                      4106
#define PIE3_RXB0IE                   4107
#define RXBnIE                        4108
#define RXBNIE                        4109
#define PIE3_RXB1IE                   4110
#define PIE3_TXB0IE                   4111
#define PIE3_TXB1IE                   4112
#define TXBnIE                        4113
#define PIE3_TXB2IE                   4114
#define TXBNIE                        4115
#define ERRIE                         4116
#define WAKIE                         4117
#define IRXIE                         4118
#define PIR3                          4119
#define FIFOWMIF                      4120
#define RXB0IF                        4121
#define RXBnIF                        4122
#define RXBNIF                        4123
#define RXB1IF                        4124
#define TXB0IF                        4125
#define TXB1IF                        4126
#define TXB2IF                        4127
#define TXBNIF                        4128
#define TXBnIF                        4129
#define ERRIF                         4130
#define WAKIF                         4131
#define IRXIF                         4132
#define IPR3                          4133
#define RXB0IP                        4134
#define FIFOWMIP                      4135
#define RXB1IP                        4136
#define RXBNIP                        4137
#define RXBnIP                        4138
#define TXB0IP                        4139
#define TXB1IP                        4140
#define TXBNIP                        4141
#define TXBnIP                        4142
#define TXB2IP                        4143
#define ERRIP                         4144
#define WAKIP                         4145
#define IRXIP                         4146
#define EECON1                        4147
#define RD                            4148
#define WR                            4149
#define WREN                          4150
#define WRERR                         4151
#define FREE                          4152
#define CFGS                          4153
#define EEFS                          4154
#define EEPGD                         4155
#define RCSTA                         4156
#define RCD8                          4157
#define RX9D                          4158
#define OERR                          4159
#define FERR                          4160
#define ADDEN                         4161
#define ADEN                          4162
#define CREN                          4163
#define SRENA                         4164
#define SREN                          4165
#define RC9                           4166
#define RC8_9                         4167
#define RX9                           4168
#define SPEN                          4169
#define TXSTA                         4170
#define TXD8                          4171
#define TX9D1                         4172
#define TX9D                          4173
#define TRMT                          4174
#define TRMT1                         4175
#define BRGH1                         4176
#define BRGH                          4177
#define SENDB1                        4178
#define SENDB                         4179
#define SYNC                          4180
#define SYNC1                         4181
#define TXEN1                         4182
#define TXEN                          4183
#define TX91                          4184
#define TX8_9                         4185
#define TX9                           4186
#define CSRC1                         4187
#define CSRC                          4188
#define T3CON                         4189
#define TMR3ON                        4190
#define TMR3CS                        4191
#define nT3SYNC                       4192
#define T3NSYNC                       4193
#define NOT_T3SYNC                    4194
#define T3SYNC                        4195
#define SOSCEN3                       4196
#define T3CCP1                        4197
#define T3CKPS                        4198
#define T3CKPS0                       4199
#define T3CKPS1                       4200
#define T3ECCP1                       4201
#define T3CCP2                        4202
#define T3CON_RD16                    4203
#define RD163                         4204
#define T3RD16                        4205
#define CMCON                         4206
#define CM                            4207
#define CMEN0                         4208
#define CM0                           4209
#define CMEN1                         4210
#define CM1                           4211
#define CMEN2                         4212
#define CM2                           4213
#define CIS                           4214
#define C1INV                         4215
#define C2INV                         4216
#define C1OUT                         4217
#define C2OUT                         4218
#define CVRCON                        4219
#define CVR                           4220
#define CVR0                          4221
#define CVR1                          4222
#define CVR2                          4223
#define CVR3                          4224
#define CVRCON_CVREF                  4225
#define CVRSS                         4226
#define CVRR                          4227
#define CVROEN                        4228
#define CVROE                         4229
#define CVREN                         4230
#define ECCP1AS                       4231
#define PSSBD                         4232
#define PSSBD0                        4233
#define PSSBD1                        4234
#define PSSAC                         4235
#define PSSAC0                        4236
#define PSSAC1                        4237
#define ECCPAS0                       4238
#define ECCPAS                        4239
#define ECCPAS1                       4240
#define ECCPAS2                       4241
#define ECCPASE                       4242
#define ECCP1DEL                      4243
#define PDC0                          4244
#define PDC                           4245
#define PDC1                          4246
#define PDC2                          4247
#define PDC3                          4248
#define PDC4                          4249
#define PDC5                          4250
#define PDC6                          4251
#define PRSEN                         4252
#define BAUDCON                       4253
#define ABDEN                         4254
#define W4E                           4255
#define WUE                           4256
#define BRG16                         4257
#define TXCKP                         4258
#define SCKP                          4259
#define RXCKP                         4260
#define RXDTP                         4261
#define RCIDL                         4262
#define ABDOVF                        4263
#define ECCP1CON                      4264
#define ECCP1M                        4265
#define ECCP1M0                       4266
#define ECCP1M1                       4267
#define ECCP1M2                       4268
#define ECCP1M3                       4269
#define EDC1B                         4270
#define EDC1B0                        4271
#define EDC1B1                        4272
#define EPWM1M0                       4273
#define EPWM1M                        4274
#define EPWM1M1                       4275
#define CCP1CON                       4276
#define CCP1M0                        4277
#define CCP1M                         4278
#define CCP1M1                        4279
#define CCP1M2                        4280
#define CCP1M3                        4281
#define DC1B                          4282
#define DC1B0                         4283
#define DC1B1                         4284
#define ADCON2                        4285
#define ADCS0                         4286
#define ADCS                          4287
#define ADCS1                         4288
#define ADCS2                         4289
#define ACQT0                         4290
#define ACQT                          4291
#define ACQT1                         4292
#define ACQT2                         4293
#define ADFM                          4294
#define ADCON1                        4295
#define PCFG0                         4296
#define PCFG                          4297
#define PCFG1                         4298
#define PCFG2                         4299
#define CHSN3                         4300
#define PCFG3                         4301
#define VCFG                          4302
#define VCFG0                         4303
#define VCFG01                        4304
#define VCFG11                        4305
#define VCFG1                         4306
#define ADCON0                        4307
#define ADON                          4308
#define nDONE                         4309
#define GO_nDONE                      4310
#define NOT_DONE                      4311
#define GODONE                        4312
#define GO_DONE                       4313
#define DONE                          4314
#define GO_NOT_DONE                   4315
#define GO                            4316
#define CHS0                          4317
#define CHS                           4318
#define CHS1                          4319
#define CHS2                          4320
#define CHS3                          4321
#define SSPCON2                       4322
#define SEN                           4323
#define RSEN                          4324
#define PEN                           4325
#define RCEN                          4326
#define ACKEN                         4327
#define ACKDT                         4328
#define ACKSTAT                       4329
#define GCEN                          4330
#define SSPCON1                       4331
#define SSPM0                         4332
#define SSPM                          4333
#define SSPM1                         4334
#define SSPM2                         4335
#define SSPM3                         4336
#define CKP                           4337
#define SSPEN                         4338
#define SSPOV                         4339
#define WCOL                          4340
#define SSPSTAT                       4341
#define BF                            4342
#define UA                            4343
#define R_NOT_W                       4344
#define READ_WRITE                    4345
#define NOT_W                         4346
#define R_W                           4347
#define nW                            4348
#define RW                            4349
#define nWRITE                        4350
#define R                             4351
#define NOT_WRITE                     4352
#define R_nW                          4353
#define I2C_READ                      4354
#define START                         4355
#define S                             4356
#define I2C_START                     4357
#define STOP                          4358
#define I2C_STOP                      4359
#define P                             4360
#define NOT_A                         4361
#define DATA_ADDRESS                  4362
#define nA                            4363
#define D_A                           4364
#define D_nA                          4365
#define D                             4366
#define DA                            4367
#define D_NOT_A                       4368
#define NOT_ADDRESS                   4369
#define nADDRESS                      4370
#define I2C_DAT                       4371
#define CKE                           4372
#define SMP                           4373
#define T2CON                         4374
#define T2CKPS0                       4375
#define T2CKPS                        4376
#define T2CKPS1                       4377
#define TMR2ON                        4378
#define T2OUTPS0                      4379
#define TOUTPS                        4380
#define T2OUTPS1                      4381
#define T2OUTPS2                      4382
#define T2OUTPS3                      4383
#define PR2                           4384
#define WM0                           4385
#define WM1                           4386
#define WAIT0                         4387
#define WAIT1                         4388
#define EBDIS                         4389
#define T1CON                         4390
#define TMR1ON                        4391
#define TMR1CS                        4392
#define NOT_T1SYNC                    4393
#define T1SYNC                        4394
#define nT1SYNC                       4395
#define T1INSYNC                      4396
#define T1OSCEN                       4397
#define SOSCEN                        4398
#define T1CKPS0                       4399
#define T1CKPS                        4400
#define T1CKPS1                       4401
#define T1RUN                         4402
#define T1RD16                        4403
#define T1CON_RD16                    4404
#define RCON                          4405
#define BOR                           4406
#define NOT_BOR                       4407
#define nBOR                          4408
#define POR                           4409
#define nPOR                          4410
#define NOT_POR                       4411
#define PD                            4412
#define nPD                           4413
#define NOT_PD                        4414
#define NOT_TO                        4415
#define nTO                           4416
#define TO                            4417
#define nRI                           4418
#define NOT_RI                        4419
#define RI                            4420
#define SBOREN                        4421
#define IPEN                          4422
#define WDTCON                        4423
#define SWDTE                         4424
#define SWDTEN                        4425
#define HLVDCON                       4426
#define HLVDL                         4427
#define HLVDL0                        4428
#define LVV0                          4429
#define LVDL0                         4430
#define HLVDL1                        4431
#define LVDL1                         4432
#define LVV1                          4433
#define HLVDL2                        4434
#define LVV2                          4435
#define LVDL2                         4436
#define HLVDL3                        4437
#define LVV3                          4438
